[
  {
    "id": "start",
    "text": "Welcome to the official platform of the Electronic Governance System (NG0204) for High School Enrollment. Please select the section for which you would like to receive detailed information.",
    "options": [
      { "text": "Required Documents and Prerequisites", "next": "documents" },
      { "text": "Enrollment Procedure", "next": "process" },
      { "text": "Deadlines, Cost, and Exceptions", "next": "deadlines" },
      { "text": "Special Cases (Student Transfer from Abroad)", "next": "external" },
      { "text": "Legal Framework and Contact Information", "next": "contact" }
    ]
  },
  {
    "id": "documents",
    "text": "To complete the enrollment process for High School, the following documents are required:\n\n• Original elementary school certificate or an equivalency certificate (for students who have completed elementary education).\n• Proof of permanent residence.\n• Identification document of the student (a photocopy of the identity card or a municipal certificate).\n• (If applicable) A sworn declaration from the guardian, as mandated by the relevant regulations.",
    "options": [
      { "text": "Return to Main Menu", "next": "start" },
      { "text": "Next: Enrollment Procedure", "next": "process" }
    ]
  },
  {
    "id": "process",
    "text": "The official enrollment procedure includes the following steps:\n\n1. Submission of the required documents at the designated school office or the Secondary Education Directorate.\n2. Verification and registration of the student’s data in the official information system (e.g., mySchool).\n3. Finalization of the enrollment process and issuance of an official enrollment certificate.\n\nThis process is carried out automatically for students under the age of 16.",
    "options": [
      { "text": "Return to Main Menu", "next": "start" },
      { "text": "Next: Deadlines and Cost", "next": "deadlines" }
    ]
  },
  {
    "id": "deadlines",
    "text": "Enrollments are generally conducted from April 1 to June 30, with document submissions accepted during working hours (08:00 to 14:00). In cases of late enrollment, submission of documents is permitted up to 5 days after the start of classes, subject to official approval by the Director. The service is provided free of charge, except in special cases that require additional evaluation.",
    "options": [
      { "text": "Return to Main Menu", "next": "start" },
      { "text": "Next: Special Cases", "next": "external" }
    ]
  },
  {
    "id": "external",
    "text": "In cases where the parent wishes to enroll a student transferring from abroad, please note the following:\n\n• For students transferring from a European Union country, official translations of documents into Greek and authentication by the competent authorities of the country of origin are required.\n• For students from non-EU countries, a detailed evaluation of the documents is necessary, and an additional interview with the competent authorities of the Ministry of Education may be scheduled.\n\nPlease verify your situation and proceed according to the instructions provided by the responsible authority.",
    "options": [
      { "text": "Return to Main Menu", "next": "start" },
      { "text": "Next: Legal Framework and Contact Information", "next": "contact" }
    ]
  },
  {
    "id": "contact",
    "text": "For further clarification and support, please contact the following:\n\n• The designated enrollment office of your school.\n• The Secondary Education Directorate of the Ministry of Education.\n• For legal inquiries, please consult the Ministry’s Legal Department and refer to the relevant ministerial decisions (e.g., MD 77231/2022, MD 79942/2019).\nFull contact details are available on the official Ministry of Education website.",
    "options": [
      { "text": "Return to Main Menu", "next": "start" },
      { "text": "End Conversation", "next": "end" }
    ]
  },
  {
    "id": "end",
    "text": "Thank you for your inquiry. We hope the provided information will assist you in successfully completing the enrollment process. Best of luck.",
    "options": []
  }
]
