[
  {
    "id": "start",
    "text": "Καλωσορίσατε στην επίσημη πλατφόρμα του Συστήματος Ηλεκτρονικής Διακυβέρνησης για την υπηρεσία 'Εγγραφή μαθητών/τριών στο Γυμνάσιο'. Επιλέξτε την ενότητα για την οποία επιθυμείτε να λάβετε λεπτομερείς πληροφορίες:",
    "options": [
      { "text": "Προαπαιτούμενα Δικαιολογητικά", "next": "documents" },
      { "text": "Διαδικασία Εγγραφής", "next": "process" },
      { "text": "Προθεσμίες, Κόστος και Εξαιρέσεις", "next": "deadlines" },
      { "text": "Ειδικές Περιπτώσεις (Μεταφορά μαθητή από το εξωτερικό)", "next": "external" },
      { "text": "Νομικό Πλαίσιο και Επικοινωνία", "next": "contact" }
    ]
  },
  {
    "id": "documents",
    "text": "Για την ολοκλήρωση της διαδικασίας εγγραφής στο Γυμνάσιο απαιτούνται τα εξής έγγραφα:\n\n• Πρωτότυπος απολυτήριος τίτλος Δημοτικού ή πιστοποιητικό αντιστοιχίας για μαθητές που έχουν αποφοιτήσει από το Δημοτικό.\n• Αποδεικτικό μόνιμης κατοικίας.\n• Ταυτοποιητικό έγγραφο του μαθητή (φωτοαντίγραφο ταυτότητας ή πιστοποιητικό Δήμου).\n• (Υπό προϋπόθεση) Υπεύθυνη δήλωση του κηδεμόνα, εφόσον προβλέπεται από τις ειδικές διατάξεις.",
    "options": [
      { "text": "Επιστροφή στο κύριο μενού", "next": "start" },
      { "text": "Επόμενο: Διαδικασία Εγγραφής", "next": "process" }
    ]
  },
  {
    "id": "process",
    "text": "Η επίσημη διαδικασία εγγραφής περιλαμβάνει τα εξής στάδια:\n\n1. Υποβολή των απαιτούμενων δικαιολογητικών στο αρμόδιο γραφείο του σχολείου ή στη Διεύθυνση Δευτεροβάθμιας Εκπαίδευσης.\n2. Επιβεβαίωση και καταχώρηση των στοιχείων του μαθητή στο επίσημο πληροφοριακό σύστημα (π.χ. mySchool).\n3. Τελική ολοκλήρωση της εγγραφής και έκδοση επίσημου αποδεικτικού εγγραφής.\n\nΗ διαδικασία διεξάγεται αυτεπάγγελτα για τους μαθητές που δεν έχουν υπερβεί το 16ο έτος της ηλικίας τους.",
    "options": [
      { "text": "Επιστροφή στο κύριο μενού", "next": "start" },
      { "text": "Επόμενο: Προθεσμίες και Κόστος", "next": "deadlines" }
    ]
  },
  {
    "id": "deadlines",
    "text": "Οι εγγραφές πραγματοποιούνται από την 1η έως τις 30 Ιουνίου, με το γραφείο εγγραφών να λειτουργεί από τις 08:00 έως τις 14:00. Σε περιπτώσεις εκπρόθεσμης εγγραφής, δίνεται δυνατότητα κατάθεσης δικαιολογητικών έως 5 ημέρες μετά την έναρξη των μαθημάτων, με επίσημη έγκριση από τον αρμόδιο Διευθυντή. Η υπηρεσία παρέχεται χωρίς κόστος, εκτός σε ειδικές περιπτώσεις που απαιτούν πρόσθετη αξιολόγηση.",
    "options": [
      { "text": "Επιστροφή στο κύριο μενού", "next": "start" },
      { "text": "Επόμενο: Ειδικές Περιπτώσεις", "next": "external" }
    ]
  },
  {
    "id": "external",
    "text": "Σε περίπτωση που ο γονέας επιθυμεί να εγγράψει παιδί που μεταφέρεται από το εξωτερικό, παρακαλούμε σημειώστε τα εξής:\n\n• Για μαθητές που μεταφέρονται από χώρα μέλους της Ευρωπαϊκής Ένωσης, απαιτείται επίσημη μετάφραση των δικαιολογητικών στα Ελληνικά και βεβαίωση από τις αρμόδιες αρχές της χώρας καταγωγής.\n• Για μαθητές από χώρες εκτός της Ευρωπαϊκής Ένωσης, απαιτείται λεπτομερής αξιολόγηση των δικαιολογητικών και πιθανή πρόσθετη συνέντευξη με τους αρμόδιους φορείς του Υπουργείου Παιδείας.\n\nΠαρακαλούμε επιβεβαιώστε την κατάσταση και προχωρήστε σύμφωνα με τις οδηγίες του αρμόδιου φορέα.",
    "options": [
      { "text": "Επιστροφή στο κύριο μενού", "next": "start" },
      { "text": "Επόμενο: Νομικό Πλαίσιο και Επικοινωνία", "next": "contact" }
    ]
  },
  {
    "id": "contact",
    "text": "Για περαιτέρω διευκρινίσεις, παρακαλούμε επικοινωνήστε με τα εξής:\n\n• Το αρμόδιο γραφείο εγγραφών του σχολείου σας.\n• Τη Διεύθυνση Δευτεροβάθμιας Εκπαίδευσης του Υπουργείου Παιδείας.\n• Για νομικές απορίες, συμβουλευτείτε το Νομικό Τμήμα του Υπουργείου και τις σχετικές υπουργικές αποφάσεις (π.χ. ΥΑ 77231/2022, ΥΑ 79942/2019).\nΤα πλήρη στοιχεία επικοινωνίας είναι διαθέσιμα στον επίσημο ιστότοπο του Υπουργείου Παιδείας.",
    "options": [
      { "text": "Επιστροφή στο κύριο μενού", "next": "start" },
      { "text": "Τέλος Συνομιλίας", "next": "end" }
    ]
  },
  {
    "id": "end",
    "text": "Σας ευχαριστούμε για την επικοινωνία. Ελπίζουμε οι παρεχόμενες πληροφορίες να σας βοηθήσουν στην ορθή διεξαγωγή της διαδικασίας εγγραφής. Καλή επιτυχία.",
    "options": []
  }
]
